/**
*  -------------------  舆情分析-舆情流量 -------------------
**/
请求地址 ： http : // 127.0.0.1:8080/public_flow
请求数据：
{
  areaId : '001_0' (查看枚举表)
  areaName : '长寿路' （查看枚举表）
  dataRange : [
    ‘2017 - 01 - 01 ’,
    ‘2017 - 01 - 31 ’
  ],
  type : 0; // 根据  接口(public_flow_getTypeNames)返回的type
}

返回数据(根据type 返回不同的数据)：
{
  "code" : 1,
  "data" : [
    {
      name: '全部（新闻+微博+公众号）',
      value: {
        "uv": [
          {
            "date": "2017-01-00",
            "value": 132
          },
          .......{
            "date": "2017-01-06",
            "value": 404
          }
        ],
        "pv": [
          {
            "date": "2017-01-00",
            "value": 132
          },
          .......{
            "date": "2017-01-06",
            "value": 404
          }
        ]
      }
    },
    {
      name: '全部（新闻）',
      value: {
        "uv": [
          {
            "date": "2017-01-00",
            "value": 132
          },
          .......{
            "date": "2017-01-06",
            "value": 404
          }
        ],
        "pv": [
          {
            "date": "2017-01-00",
            "value": 132
          },
          .......{
            "date": "2017-01-06",
            "value": 404
          }
        ]
      }
    },
    {
      name: '全部（微博）',
      value: {
        "uv": [
          {
            "date": "2017-01-00",
            "value": 132
          },
          .......{
            "date": "2017-01-06",
            "value": 404
          }
        ],
        "pv": [
          {
            "date": "2017-01-00",
            "value": 132
          },
          .......{
            "date": "2017-01-06",
            "value": 404
          }
        ]
      }
    },
    {
      name: '全部（公众号）',
      value: {
        "uv": [
          {
            "date": "2017-01-00",
            "value": 132
          },
          .......{
            "date": "2017-01-06",
            "value": 404
          }
        ],
        "pv": [
          {
            "date": "2017-01-00",
            "value": 132
          },
          .......{
            "date": "2017-01-06",
            "value": 404
          }
        ]
      }
    }
  ],
  "success" : true
}
