{
  name: '崇明区',
  id: '018',
  childrens: [
    {
      name: '崇明县其他',
      id: '018_0'
    },
    {
      name: '城桥镇',
      id: '018_1'
    },
    {
      name: '堡镇',
      id: '018_2'
    },
    {
      name: '新河镇',
      id: '018_3'
    },
    {
      name: '庙镇',
      id: '018_4'
    },
    {
      name: '竖新镇',
      id: '018_5'
    },
    {
      name: '向化镇',
      id: '018_6'
    },
    {
      name: '三星镇',
      id: '018_7'
    },
    {
      name: '港沿镇',
      id: '018_8'
    },
    {
      name: '中兴镇',
      id: '018_9'
    },
    {
      name: '陈家镇',
      id: '018_10'
    },
    {
      name: '绿华镇',
      id: '018_11'
    },
    {
      name: '港西镇',
      id: '018_12'
    },
    {
      name: '建设镇',
      id: '018_13'
    },
    {
      name: '新海镇',
      id: '018_14'
    },
    {
      name: '东平镇',
      id: '018_15'
    },
    {
      name: '长兴镇',
      id: '018_16'
    },
    {
      name: '新村乡',
      id: '018_17'
    },
    {
      name: '横沙乡',
      id: '018_18'
    }
]
}
