/**
*  -------------------  整体分布-分场景 -------------------
**/
请求地址 ： http : // 127.0.0.1:8080/service_web
请求数据：
{
  areaId : '001_0' (查看枚举表)
  areaName : '长寿路' （查看枚举表）
  dataRange : [
    ‘2017 - 01 - 01 ’,
    ‘2017 - 01 - 31 ’
  ]
  type : 0;
}

type枚举：
type : [
  {
    name: '网站1',
    id: 0
  }, {
    name: '网站2',
    id: 1
  }, {
    name: '网站3',
    id: 2
  }
]

返回数据：
{
  "code" : 0,
  "data" : {
    "uv": [
      {
        "date": "2017-01-00",
        "value": 132
      }, {
        "date": "2017-01-01",
        "value": 101
      }, {
        "date": "2017-01-02",
        "value": 444
      }, {
        "date": "2017-01-03",
        "value": 556
      }, {
        "date": "2017-01-04",
        "value": 474
      }, {
        "date": "2017-01-05",
        "value": 242
      }, {
        "date": "2017-01-06",
        "value": 404
      }
    ],
    "pv": [
      {
        "date": "2017-01-00",
        "value": 312
      }, {
        "date": "2017-01-01",
        "value": 549
      }, {
        "date": "2017-01-02",
        "value": 224
      }, {
        "date": "2017-01-03",
        "value": 181
      }, {
        "date": "2017-01-04",
        "value": 184
      }, {
        "date": "2017-01-05",
        "value": 515
      }, {
        "date": "2017-01-06",
        "value": 135
      }
    ]
  },
  "success" : true
}
