/**
*  -------------------  整体分布-分场景 -------------------
**/
请求地址 ： http : // 127.0.0.1:8080/public_flow
请求数据：
{
  areaId : '001_0' (查看枚举表)
  areaName : '长寿路' （查看枚举表）
  dataRange : [
    ‘2017 - 01 - 01 ’,
    ‘2017 - 01 - 31 ’
  ]
  type : 0;
}

type枚举：
type : [
  {
    name: '全部',
    id: 0
  }, {
    name: '新闻',
    id: 1
  }, {
    name: '微博',
    id: 2
  }, {
    name: '公众号',
    id: 3
  }
]

返回数据：
{
  "code" : 0,
  "data" : [
    // [所有新闻,] 、 新闻1 、 微博1、 公众号1
    {
      "uv": [
        {
          "date": "2017-01-00",
          "value": 132
        },
        .......
         {
          "date": "2017-01-06",
          "value": 404
        }
      ],
      "pv": [
        {
          "date": "2017-01-00",
          "value": 132
        },
        .......
         {
          "date": "2017-01-06",
          "value": 404
        }
      ]
    },
      // [所有微博,] 、 新闻2、 微博2、 公众号2
    {
      "uv": [
        {
          "date": "2017-01-00",
          "value": 132
        },
        .......
         {
          "date": "2017-01-06",
          "value": 404
        }
      ],
      "pv": [
        {
          "date": "2017-01-00",
          "value": 132
        },
        .......
         {
          "date": "2017-01-06",
          "value": 404
        }
      ]
    },
    // [所有微公众号] 、 新闻3、 微博3、 公众号3
    {
      "uv": [
        {
          "date": "2017-01-00",
          "value": 132
        },
        .......
         {
          "date": "2017-01-06",
          "value": 404
        }
      ],
      "pv": [
        {
          "date": "2017-01-00",
          "value": 132
        },
        .......
         {
          "date": "2017-01-06",
          "value": 404
        }
      ]
    }
  ],
  "success" : true
}
